{
    "class_name": "Functional",
    "config": {
        "name": "model",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        198,
                        198,
                        3
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d",
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d_1",
                "inbound_nodes": [
                    [
                        [
                            "conv2d",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "batch_normalization",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.compat.v1.nn.max_pool",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "compat.v1.nn.max_pool"
                },
                "name": "tf.compat.v1.nn.max_pool",
                "inbound_nodes": [
                    [
                        "batch_normalization",
                        0,
                        0,
                        {
                            "ksize": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "strides": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "padding": "VALID",
                            "data_format": "NHWC"
                        }
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 96,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d_2",
                "inbound_nodes": [
                    [
                        [
                            "tf.compat.v1.nn.max_pool",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "batch_normalization_1",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.compat.v1.nn.max_pool_1",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "compat.v1.nn.max_pool"
                },
                "name": "tf.compat.v1.nn.max_pool_1",
                "inbound_nodes": [
                    [
                        "batch_normalization_1",
                        0,
                        0,
                        {
                            "ksize": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "strides": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "padding": "VALID",
                            "data_format": "NHWC"
                        }
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d_3",
                "inbound_nodes": [
                    [
                        [
                            "tf.compat.v1.nn.max_pool_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_2",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "batch_normalization_2",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.compat.v1.nn.max_pool_2",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "compat.v1.nn.max_pool"
                },
                "name": "tf.compat.v1.nn.max_pool_2",
                "inbound_nodes": [
                    [
                        "batch_normalization_2",
                        0,
                        0,
                        {
                            "ksize": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "strides": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "padding": "VALID",
                            "data_format": "NHWC"
                        }
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 160,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d_4",
                "inbound_nodes": [
                    [
                        [
                            "tf.compat.v1.nn.max_pool_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_3",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "batch_normalization_3",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.compat.v1.nn.max_pool_3",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "compat.v1.nn.max_pool"
                },
                "name": "tf.compat.v1.nn.max_pool_3",
                "inbound_nodes": [
                    [
                        "batch_normalization_3",
                        0,
                        0,
                        {
                            "ksize": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "strides": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "padding": "VALID",
                            "data_format": "NHWC"
                        }
                    ]
                ]
            },
            {
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_5",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 192,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "valid",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "groups": 1,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "conv2d_5",
                "inbound_nodes": [
                    [
                        [
                            "tf.compat.v1.nn.max_pool_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_4",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": [
                        3
                    ],
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "batch_normalization_4",
                "inbound_nodes": [
                    [
                        [
                            "conv2d_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.compat.v1.nn.max_pool_4",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "compat.v1.nn.max_pool"
                },
                "name": "tf.compat.v1.nn.max_pool_4",
                "inbound_nodes": [
                    [
                        "batch_normalization_4",
                        0,
                        0,
                        {
                            "ksize": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "strides": [
                                1,
                                2,
                                2,
                                1
                            ],
                            "padding": "VALID",
                            "data_format": "NHWC"
                        }
                    ]
                ]
            },
            {
                "class_name": "TFOpLambda",
                "config": {
                    "name": "tf.math.reduce_max",
                    "trainable": true,
                    "dtype": "float32",
                    "function": "math.reduce_max"
                },
                "name": "tf.math.reduce_max",
                "inbound_nodes": [
                    [
                        "tf.compat.v1.nn.max_pool_4",
                        0,
                        0,
                        {
                            "axis": [
                                1,
                                2
                            ],
                            "keepdims": false
                        }
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [
                    [
                        [
                            "tf.math.reduce_max",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_1",
                "inbound_nodes": [
                    [
                        [
                            "tf.math.reduce_max",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "sex",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 2,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "sex",
                "inbound_nodes": [
                    [
                        [
                            "dense",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "age",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 11,
                    "activation": "softmax",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "age",
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_1",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "sex",
                0,
                0
            ],
            [
                "age",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.7.0",
    "backend": "tensorflow"
}